[
    {
        "title":"SOFTWARE DEVELOPER",
        "date":"March 2025 to October 2025",
        "company": "Amaris Consulting",
        "description": [
            "Led the development of a Meta-integrated chatbot system, combining Node.js and Java (Spring Boot) microservices to deliver reliable, scalable automation features.",
            "Designed and implemented microservices and scheduled cron jobs in Spring Boot to streamline backend operations and improve overall system efficiency.",
            "Developed and enhanced front-end modules using Angular and TypeScript, ensuring strong UX principles and responsive, maintainable interfaces.",
            "Configured and maintained Azure DevOps CI/CD pipelines, managing build and release workflows, and monitoring App Services to support continuous deployment and integration.",
            "Worked extensively with Azure Cosmos DB, structuring and managing collections to handle dynamic chatbot data efficiently and securely.",
            "Collaborated with cross-functional teams to deliver cutting-edge features, ensure code quality, and align backend and frontend implementations for optimal performance.",
            "Applied best practices in clean code, modular architecture, and API integration to enhance maintainability and scalability across services."
        ],
        "latest":1
    },
    {
        "title":"SOFTWARE DEVELOPER",
        "date":"Feb 2022 to Dec 2024",
        "company": "Project s & Systems LTDA",
        "description": [
            "Management of applications in PHP, Node js and Angular language. In these projects,we implemented the MVC (Model-View-Controller) pattern to keep the project organized and the codebase readable.",
            "Creating APIs and microservices using PHP with Slim and Laravel frameworks, as well as Node.js with Express.js. Implementing routing, token middleware, and request validations in both environments to ensure secure and efficient API operations.",
            "Managing databases with MySQL and MongoDB, employing frameworks like Knex and Mongoose to enhance data handling. Using MySQL to store personal information, such as customer data, and MongoDB to handle data like tokens",
            "Collaborating closely with a team to develop and implement software solutions for various projects. Managing repositories with dierent branches and coordinating team efforts to avoid conicts when pushing commits, ensuring smooth and efficient collaboration.",
            "Designing and implementing efficient algorithms to tackle complex technical challenges, which leads to improved system performance and reduced development time. Utilizing SOLID principles and refactoring code to enhance efficiency, maintainability, and overall code quality.",
            "Utilizing PHP, Node.js, and Angular to develop software applications, ensuring high quality and adherence to coding standards. Incorporating unit testing to verify that each component functions correctly and meets the required specications.",
            "During the migration of projects from PHP to Node, TypeScript was adopted to enhance the development process. Utilizing TypeScript’s features, including interfaces and strong static typing, to improve code reliability and maintainability.",
            "Utilizing Azure DevOps for comprehensive project management, including managing user stories, appraising their progress, and overseeing the repository. Employing Azure Pipelines for deploying changes efficienttly and ensuring continuous integration and delivery. Additionally, using SonarQube within Azure DevOps to enforce clean code practices and maintain high code quality standards."
        ]
    },
    {
        "title":"FULL STACK SUPPORT ENGINEER",
        "date":"Nov 2021 to Jan 2022",
        "company": "Certicamara",
        "description": [
            "Product support.",
            "Reports generation.",
            "Management of microservices with Java Spring boot, which controlled the status changes of the invoices managed by the company, it was linked to the database and in turn consumed different external API rest and soap services.",
            "Validation of the rest and soap API services when errors were generated when processing invoices, which is why request validations were carried out to find the consumption failure.",
            "Management of relational and non-relational databases with MySql and Oracle to manage personal information of clients and Mongodb to invoice statuses and information.",
            "Deployment of company products to customers."
        ]
    },
    {
        "title":"SUPPORT AGENT",
        "date":"Sep 2021 to Oct 2021",
        "company": "Certicamara",
        "description": [
            "Customer Support."
        ]
    }
]