[
    {
        "title": "E-commerce",
        "description": "In this project, I utilized a combination of cutting-edge technologies to develop a robust e-commerce platform. The frontend was built using AngularJS, a powerful JavaScript framework known for its flexibility and efficiency in crafting dynamic user interfaces. Leveraging the utility-first CSS framework Tailwind CSS, I ensured a sleek and responsive design that enhances user experience across various devices. For the backend infrastructure, I employed Node.js, a server-side runtime environment renowned for its scalability and speed. With Node.js, I created a resilient backend system capable of handling high volumes of traffic and concurrent user interactions. To manage the database operations efficiently, I utilized MySQL through Knex.js, enabling seamless data manipulation and retrieval.",
        "link": "https://e-commerceduvan.netlify.app",
        "github": "#",
        "image": "/assets/img/e-commerce.webp",
        "tags": ["angular", "node", "tailwind"]
    },
    {
        "title": "Casino",
        "description": "This project is built with Angular and node js, utilizing a clean and structured architecture. It features guards for authentication, ensuring that users are redirected to the login page if they don’t have a valid token. The project also includes interceptors that automatically attach the token to HTTP requests, allowing seamless authentication with the backend. Services are created to interact with the APIs via HTTP calls, and models and interfaces are used throughout the project to ensure the use of typed data. The project is styled with Tailwind CSS and Angular Material, providing a responsive and modern user interface. The login interface uses a default username and password for authentication, and once logged in, users can access other routes protected by the authentication guard. The token is saved in cookies and is automatically included in the HTTP requests through the interceptor.",
        "link": "https://duvancasino.netlify.app/",
        "github": "#",
        "image": "/assets/img/casino.webp",
        "tags": ["angular", "node", "tailwind"]
    }
]